oscillating_airfoil2D/case-SST/0/include/cyclicAMI
  airfoilzone_surface
  {
    type cyclicAMI;
  }
  airfoilzone_surface_slave
  {
    type cyclicAMI;
  }
