oscillating_airfoil2D/case-SST/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 2.8394e-5; // Set to nu for nu_t/nu = 1

boundaryField
{
    far
    {
        type            freestream;
        freestreamValue $internalField;
    }
    airfoil_surface
    {
        type            nutkWallFunction; // standard for k-omega SST
        value           uniform 0;
    }
    background_ymin  { type empty; }
    airfoilzone_ymin { type empty; }
    #include        "include/cyclicAMI"
}
