oscillating_airfoil2D/case-SST/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 50690;

boundaryField
{
    far
    {
        type            freestream;
        freestreamValue $internalField;
    }
    airfoil_surface
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    background_ymin  { type empty; }
    airfoilzone_ymin { type empty; }
    #include        "include/cyclicAMI"
}
